---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkLoadResultType.LinkExists
enum: Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType.LinkExists

Revit already has a link with the input location, so no new link
 can be created.